app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all.reverse

INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "eeasa"], ["title", "em"], ["content", "sdasd"], ["created_at", 2016-08-11 17:06:22 UTC], ["updated_at", 2016-08-11 17:06:22 UTC]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save